# 1. Import Library

In [1]:
import pandas as pd

# 2. Load Data

## Title Basics

In [8]:
basics = pd.read_csv('Data/title_basics.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

## Title Ratings

In [9]:
ratings = pd.read_csv('Data/title_ratings.csv.gz')
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1982
1  tt0000002            5.8       265
2  tt0000005            6.2      2625
3  tt0000006            5.1       182
4  tt0000007            5.4       820

## The TMDB API Results (tmdb_results_combined)

In [6]:
tmdb = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.500,22.0,NaN
2,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,"{'id': 1131062, 'name': 'Wong Kar-Wai’s Love T...",150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",NaN,843.0,cn,花樣年華,...,14204632.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.100,2244.0,PG
3,tt0119273,0.0,/f5C03doOWiauu37bToKXtpgP5bS.jpg,"{'id': 141086, 'name': 'Heavy Metal Collection...",15000000.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,16225.0,en,Heavy Metal 2000,...,0.0,88.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,not to survive the fight in the external world...,Heavy Metal 2000,0.0,6.105,185.0,R
4,tt0120263,0.0,/ynXVuylP8upazjz8lrqb1PEMkdR.jpg,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 35, 'name...",NaN,34070.0,sv,Sånger från andra våningen,...,80334.0,99.0,"[{'english_name': 'Russian', 'iso_639_1': 'ru'...",Released,NaN,Songs from the Second Floor,0.0,7.200,239.0,NaN

# 3. Inspect and Prepare Data

In [10]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   titleType       81799 non-null  object
 2   primaryTitle    81799 non-null  object
 3   originalTitle   81799 non-null  object
 4   isAdult         81799 non-null  int64
 5   startYear       81799 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81799 non-null  int64
 8   genres          81799 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.6+ MB

In [11]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502224 entries, 0 to 502223
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         502224 non-null  object
 1   averageRating  502224 non-null  float64
 2   numVotes       502224 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.5+ MB

In [7]:
tmdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 641 entries, 0 to 640
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                641 non-null    object
 1   adult                  639 non-null    float64
 2   backdrop_path          541 non-null    object
 3   belongs_to_collection  111 non-null    object
 4   budget                 639 non-null    float64
 5   genres                 639 non-null    object
 6   homepage               76 non-null     object
 7   id                     639 non-null    float64
 8   original_language      639 non-null    object
 9   original_title         639 non-null    object
 10  overview               637 non-null    object
 11  popularity             639 non-null    float64
 12  poster_path            621 non-null    object
 13  production_companies   639 non-null    object
 14  production_countries   639 non-null    object
 15  release_date           638 non-null    object
 16  revenue                639 non-null    float64
 17  runtime                639 non-null    float64
 18  spoken_languages       639 non-null    object
 19  status                 639 non-null    object
 20  tagline                501 non-null    object
 21  title                  639 non-null    object
 22  video                  639 non-null    float64
 23  vote_average           639 non-null    float64
 24  vote_count             639 non-null    float64
 25  certification          430 non-null    object
dtypes: float64(9), object(17)
memory usage: 130.3+ KB

## Required Transformation Steps for Title Basics:
#### Normalize Genre:

- Convert the single string of genres from title basics into 2 new tables.
1. title_genres: with the columns:

   - tconst
   - genre_id


2. genres:
   - genre_id
   - genre_name
   
#### Discard unnecessary information:

- For the `title basics` table, drop the following columns:
    - "original_title" (we will use the primary title column instead)
    - "isAdult" ("Adult" will show up in the genres so this is redundant information).
    - "titleType" (every row will be a movie).
    - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

- Do not include the `title_akas` table in your SQL database.
    - You have already filtered out the desired movies using this table, and the remaining data is mostly nulls and not of interest to the stakeholder.

## 3.1 Normalize Genre

##### 1. Get a list of all individual genres.

- First, I will need to get a list of all of the unique genres that appear in the column. 
- Right now, the genre column contains a string with the genres separated by a comma.
- I am going to convert these strings into lists of strings into a new 'genres_split' column.

In [14]:
# check the current column names
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   titleType       81799 non-null  object
 2   primaryTitle    81799 non-null  object
 3   originalTitle   81799 non-null  object
 4   isAdult         81799 non-null  int64
 5   startYear       81799 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81799 non-null  int64
 8   genres          81799 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.6+ MB

In [15]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History","[Drama, History]"
2,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama,[Drama]
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
...,...,...,...,...,...,...,...,...,...,...
81794,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
81795,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
81796,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
81797,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
81798,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

**Use .explode() to separate the list of genres into new rows: one row for each genre a movie belonged to.**

In [16]:
# explode the series using .explode()
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History",Drama
1,tt0043139,movie,Life of a Beijing Policeman,Wo zhe yi bei zi,0,2013,NaN,120,"Drama,History",History
...,...,...,...,...,...,...,...,...,...,...
81797,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Action
81797,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Adventure
81797,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
81798,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
81798,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

**Use .unique() to get the unique genres from the genres_split column and sort alphabetically**

In [17]:
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [18]:
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

##### 2. Create a new `title_genres` table

We only want the tconst and genres_split columns.

In [21]:
#Create a new dataframe which only contains the necessary columns
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0043139        Drama
1  tt0043139      History

##### 3. Create a genre mapper dictionary to replace string genres with integers

In [23]:
## Making the genre mapper dictionary
### Make a dictionary with list of unique genres as the key and unique integer ids as values
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

##### 4. Replace the string genres in title_genres with the new integer ids.

In [24]:
## make a new integer column called "genre_id", and drop the string "genres_split" column
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0043139         7
1  tt0043139        11

Now the `title_genres` table is ready for MySQL database.

##### 5. Convert the genre map dictionary into a dataframe.

In [29]:
# Make a dataframe with Genre_Name and Genre_ID columns
genre = pd.DataFrame({'Genre_Name': genre_map.keys(), 
                      'Genre_ID': genre_map.values()})
genre.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

Now the `genres` table is ready for MySQL database.

## 3.2 Discard unnecessary information:

- For the `title basics` table, drop the following columns:
    - "original_title" (we will use the primary title column instead)
    - "isAdult" ("Adult" will show up in the genres so this is redundant information).
    - "titleType" (every row will be a movie).
    - "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [30]:
# Display the current columns
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   titleType       81799 non-null  object
 2   primaryTitle    81799 non-null  object
 3   originalTitle   81799 non-null  object
 4   isAdult         81799 non-null  int64
 5   startYear       81799 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  81799 non-null  int64
 8   genres          81799 non-null  object
 9   genres_split    81799 non-null  object
dtypes: float64(1), int64(3), object(6)
memory usage: 6.2+ MB

In [31]:
# Drop the unnecessary columns
basics = basics.drop(columns=['originalTitle', 'isAdult','titleType','genres', 'genres_split'])
basics.head()

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0043139,Life of a Beijing Policeman,2013,NaN,120
2,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
3,tt0069049,The Other Side of the Wind,2018,NaN,122
4,tt0088751,The Naked Monster,2005,NaN,100

In [32]:
# Check the final column names for Title Basics
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   primaryTitle    81799 non-null  object
 2   startYear       81799 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81799 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.1+ MB

# 4. Construct MySQL Database

## MySQL Database Requirements

- Use sqlalchemy with Pandas to execute your SQL queries inside your notebook.

- Create a new database on your MySQL server and call it "movies."

- Make sure to have the following tables in your "movies" database:

   - title_basics
   - title_ratings
   - title_genres
   - genres
   - tmdb_data

- Make sure to set a Primary Key for each table that isn't a joiner table (e.g., title_genres is a joiner table).

- After creating each table, show the first 5 rows of that table using a SQL query.

- Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.

## 4.1 Establish connection to MySQL and Create Database

In [36]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
# call the new database "movies"
connection_str = "mysql+pymysql://root:root@localhost/movies"

In [37]:
engine = create_engine(connection_str)

In [39]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

## 4.2 Create Required Tables in the database

Required Tables:
   - title_basics
   - title_ratings
   - title_genres
   - genres
   - tmdb_data

`title_basics`

In [42]:
#Create "title_basics" table in MySQL database using "basics" dataframe
basics.to_sql('title_basics', engine, if_exists = 'replace')

81799

`title_ratings`

In [43]:
#Create "title_ratings" table in MySQL database using "ratings" dataframe
ratings.to_sql('title_ratings', engine, if_exists = 'replace')

502224

`title_genres`

In [44]:
#Create "title_genres" table in MySQL database using "title_genres" dataframe
title_genres.to_sql('title_genres', engine, if_exists = 'replace')

153289

`genres`

In [46]:
#Create "genres" table in MySQL database using "genre" dataframe
genre.to_sql('genres', engine, if_exists = 'replace')

25

`tmdb_data`

In [48]:
#Create "tmdb_data table in MySQL database using "tmdb" dataframe
tmdb.to_sql('tmdb_data', engine, if_exists = 'replace')

641

## 4.3 Setting the Primary Key for each table

`title_basics`

In [49]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81799 entries, 0 to 81798
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          81799 non-null  object
 1   primaryTitle    81799 non-null  object
 2   startYear       81799 non-null  int64
 3   endYear         0 non-null      float64
 4   runtimeMinutes  81799 non-null  int64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.1+ MB

Primary Key: `tconst`

Since "tconst" is a string column, I will need to go through some extra steps in order to set this column as the Primary Key.

### 4.3.1 Saving the MySQL tables with tconst as the primary key.

# 5. Export MySQL Database